# Importando as Bibliotecas

In [8]:
import pandas as pd
import numpy as np
import seaborn as sns

# Importando as bases de dados

In [11]:
pinguins = sns.load_dataset('penguins')
gorjetas = sns.load_dataset('tips')
titanic = sns.load_dataset('titanic')
quarteto_ascombe = sns.load_dataset('anscombe')

# Criando funções

Como algumas análises serão repetidas nas diferentes bases de dados eu irei criar funções para automatizar.

## Função estatisticas_agrupadas

Esta função serve para mostrar estatísticas descritivas de média, mediana, moda, variância e desvio padrão divididas por variáveis qualitativas. Abaixo irei explicar os parâmetros  

  

- Base: Esse parâmetro é referente a base de dados que será usada. 

- Categoria: Esse parâmetro deve receber o nome da coluna com a variável qualitativa. 

- Colunas: Este parâmetro deve receber um nome ou lista de colunas de variáveis quantitativas que serão usadas para fazer os cálculos das estatísticas descritivas. 

  

Sugiro usar os dicionários de dados criados nas análises para filtrar os nomes para o parâmetro coluna.

In [60]:
def estatisticas_agrupadas(base,categoria,colunas):
    print('Média'.center(100,'='))
    print('\n')
    display(base.groupby(categoria)[colunas].agg('mean'))
    print('\n')
    
    print('Mediana'.center(100,'='))
    print('\n')
    display(base.groupby(categoria)[colunas].agg('median'))
    print('\n')
    
    print('Moda'.center(100,'='))
    print('\n')
    display(base.groupby(categoria)[colunas].agg(lambda x: pd.Series.mode(x).to_list()))
    print('\n')
    
    print('Variância'.center(100,'='))
    print('\n')
    display(base.groupby(categoria)[colunas].agg('var'))
    print('\n')
    
    print('Desvio Padrão'.center(100,'='))
    print('\n')
    display(base.groupby(categoria)[colunas].agg('var'))
    print('\n')

# Analisando base de dados(Pinguins)

## Dicionário de dados

In [9]:
# criando o dicionário para a base pinquins

dict_pinquins= pd.DataFrame([
    {
        "variavel":"species",
        "descricao":"Expecie do pinguin ('Adelie', 'Chinstrap', 'Gentoo')",
        "tipo":"Qualitativa",
        "subtipo":"Nominal"
    },{
        "variavel":"island",
        "descricao":"Nome das ilhas que os pinquins vivem ('Torgersen', 'Biscoe', 'Dream')",
        "tipo":"Qualitativa",
        "subtipo":"Nominal"
    },{
        "variavel":"bill_length_mm",
        "descricao":"Comprimento do bico do pinquin em milimetros",
        "tipo":"Quantitativa",
        "subtipo":"Continua"
    },{
        "variavel":"bill_depth_mm",
        "descricao":"Profundidade do bico do pinquin em milimetros",
        "tipo":"Quantitativa",
        "subtipo":"Continua"
    },{
        "variavel":"flipper_length_mm",
        "descricao":"Comprimento da nadadeira do pinquin em milimetros",
        "tipo":"Quantitativa",
        "subtipo":"Continua"
    },{
        "variavel":"body_mass_g",
        "descricao":"Massa do pinguin em gramas",
        "tipo":"Quantitativa",
        "subtipo":"Continua"
    },{
        "variavel":"sex",
        "descricao":"Sexo dos pineuins ('Male','Female')",
        "tipo":"Qualitativa",
        "subtipo":"Nominal"
    },
])

In [10]:
df_dict

,variavel,descricao,tipo,subtipo
0,species,"Expecie do pinguin ('Adelie', 'Chinstrap', 'Ge...",Qualitativa,Nominal
1,island,Nome das ilhas que os pinquins vivem ('Torgers...,Qualitativa,Nominal
2,bill_length_mm,Comprimento do bico do pinquin em milimetros,Quantitativa,Continua
3,bill_depth_mm,Profundidade do bico do pinquin em milimetros,Quantitativa,Continua
4,flipper_length_mm,Comprimento da nadadeira do pinquin em milimetros,Quantitativa,Continua
5,body_mass_g,Massa do pinguin em gramas,Quantitativa,Continua
6,sex,"Sexo dos pineuins ('Male','Female')",Qualitativa,Nominal

## Estatísticas de tendencia central e dispersão

In [21]:
#Selecionando apenas as colunas com valores quantitativos
lista = dict_pinquins.query('tipo == "Quantitativa"')['variavel']
pinguins_filtrado = pinguins[lista]

In [22]:
#Média
pinguins_filtrado.mean()

bill_length_mm         43.921930
bill_depth_mm          17.151170
flipper_length_mm     200.915205
body_mass_g          4201.754386
dtype: float64

In [23]:
#Mediana
pinguins_filtrado.median()

bill_length_mm         44.45
bill_depth_mm          17.30
flipper_length_mm     197.00
body_mass_g          4050.00
dtype: float64

In [24]:
#Moda
pinguins_filtrado.mode()

   bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
0            41.1           17.0              190.0       3800.0

In [25]:
#Variância
pinguins_filtrado.var()

bill_length_mm           29.807054
bill_depth_mm             3.899808
flipper_length_mm       197.731792
body_mass_g          643131.077327
dtype: float64

In [26]:
#Desvio Padrão
pinguins_filtrado.std()

bill_length_mm         5.459584
bill_depth_mm          1.974793
flipper_length_mm     14.061714
body_mass_g          801.954536
dtype: float64

## Estatísticas de tendencia central e dispersão (Separadas pelas variáveis categóricas)

In [23]:
#Criando lista de nomes das variáveis quantitativas da base pinquins
lista_pinguins = dict_pinquins.query('tipo == "Quantitativa"')['variavel']
lista_pinguins

2       bill_length_mm
3        bill_depth_mm
4    flipper_length_mm
5          body_mass_g
Name: variavel, dtype: object

### Species

In [32]:
estatisticas_agrupadas(pinguins,'species',lista_pinguins)

===============================================Média================================================

           bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
species
Adelie          38.791391      18.346358         189.953642  3700.662252
Chinstrap       48.833824      18.420588         195.823529  3733.088235
Gentoo          47.504878      14.982114         217.186992  5076.016260

==============================================Mediana===============================================

           bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
species
Adelie              38.80          18.40              190.0       3700.0
Chinstrap           49.55          18.45              196.0       3700.0
Gentoo              47.30          15.00              216.0       5000.0

================================================Moda================================================

,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g
species,,,,
Adelie,[41.1],[18.5],[190.0],"[3550.0, 3800.0, 3900.0]"
Chinstrap,"[51.3, 52.0]",[17.3],"[187.0, 195.0]","[3400.0, 3650.0, 3700.0, 3800.0, 3950.0, 4050.0]"
Gentoo,"[45.2, 45.5, 46.2, 46.5, 50.0]",[15.0],[215.0],"[5000.0, 5550.0]"

=============================================Variância==============================================

           bill_length_mm  bill_depth_mm  flipper_length_mm    body_mass_g
species
Adelie           7.093725       1.480237          42.764503  210282.891832
Chinstrap       11.150630       1.289122          50.863916  147713.454785
Gentoo           9.497845       0.962792          42.054911  254133.180061

===========================================Desvio Padrão============================================

           bill_length_mm  bill_depth_mm  flipper_length_mm    body_mass_g
species
Adelie           7.093725       1.480237          42.764503  210282.891832
Chinstrap       11.150630       1.289122          50.863916  147713.454785
Gentoo           9.497845       0.962792          42.054911  254133.180061

### Island

In [33]:
estatisticas_agrupadas(pinguins,'island',lista_pinguins)

===============================================Média================================================

           bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
island
Biscoe          45.257485      15.874850         209.706587  4716.017964
Dream           44.167742      18.344355         193.072581  3712.903226
Torgersen       38.950980      18.429412         191.196078  3706.372549

==============================================Mediana===============================================

           bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
island
Biscoe              45.80           15.5              214.0       4775.0
Dream               44.65           18.4              193.0       3687.5
Torgersen           38.90           18.4              191.0       3700.0

================================================Moda================================================

,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g
island,,,,
Biscoe,"[45.2, 45.5, 46.2, 46.5, 50.0]",[15.0],[215.0],"[5000.0, 5550.0]"
Dream,[36.0],[18.5],[190.0],[3400.0]
Torgersen,"[34.6, 36.2, 36.7, 37.8, 38.6, 41.1]","[17.0, 17.2, 17.6, 19.0, 19.4]",[190.0],[3700.0]

=============================================Variância==============================================

           bill_length_mm  bill_depth_mm  flipper_length_mm    body_mass_g
island
Biscoe          22.778965       3.315026         200.003752  612863.114133
Dream           35.444479       1.283952          56.360543  173592.315762
Torgersen        9.152549       1.794118          38.840784  198121.078431

===========================================Desvio Padrão============================================

           bill_length_mm  bill_depth_mm  flipper_length_mm    body_mass_g
island
Biscoe          22.778965       3.315026         200.003752  612863.114133
Dream           35.444479       1.283952          56.360543  173592.315762
Torgersen        9.152549       1.794118          38.840784  198121.078431

### Sex

In [34]:
estatisticas_agrupadas(pinguins,'sex',lista_pinguins)

===============================================Média================================================

        bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
sex
Female       42.096970      16.425455         197.363636  3862.272727
Male         45.854762      17.891071         204.505952  4545.684524

==============================================Mediana===============================================

        bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
sex
Female            42.8          17.00              193.0       3650.0
Male              46.8          18.45              200.5       4300.0

================================================Moda================================================

       bill_length_mm bill_depth_mm flipper_length_mm       body_mass_g
sex
Female         [46.5]  [17.8, 17.9]           [187.0]          [3700.0]
Male           [41.1]  [18.5, 19.0]    [190.0, 197.0]  [3900.0, 3950.0]

=============================================Variância==============================================

        bill_length_mm  bill_depth_mm  flipper_length_mm    body_mass_g
sex
Female       24.044076       3.224470         156.269401  443785.199557
Male         28.803570       3.472075         211.640683  620359.259160

===========================================Desvio Padrão============================================

        bill_length_mm  bill_depth_mm  flipper_length_mm    body_mass_g
sex
Female       24.044076       3.224470         156.269401  443785.199557
Male         28.803570       3.472075         211.640683  620359.259160

# Analisando base de dados(Gorjetas)

## Dicionário de dados

In [34]:
# criando o dicionário para a base gorjetas

dict_gorjetas = pd.DataFrame([
    {
        "variavel":"total_bill",
        "descricao":"Valor final do pagamento (compra + gorjeta)",
        "tipo":"Quantitativa",
        "subtipo":"Continua"
    },{
        "variavel":"tip",
        "descricao":"Valor da gojeta",
        "tipo":"Quantitativa",
        "subtipo":"Continua"
    },{
        "variavel":"sex",
        "descricao":"Sexo da pessoa que pagou ('Male','Female')",
        "tipo":"Qualitativa",
        "subtipo":"Nominal"
    },{
        "variavel":"smoker",
        "descricao":"Informa se havia pessoa na mesa ('Yes','No')",
        "tipo":"Qualitativa",
        "subtipo":"Nominal"
    },{
        "variavel":"day",
        "descricao":"Indica os dias da semana ('Sun', 'Sat', 'Thur', 'Fri')",
        "tipo":"Qualitativa",
        "subtipo":"Ordinal"
    },{
        "variavel":"time",
        "descricao":"Indica se a compra foi feita em determinado periodo do dia ('Dinner', 'Lunch')",
        "tipo":"Qualitativa",
        "subtipo":"Ordinal"
    },{
        "variavel":"size",
        "descricao":"Indica o número de pessoas na mesa",
        "tipo":"Quantitativa",
        "subtipo":"Discreta"
    }
])

In [18]:
df_dict

,variavel,descricao,tipo,subtipo
0,total_bill,Valor final do pagamento (compra + gorjeta),Quantitativa,Continua
1,tip,Valor da gojeta,Quantitativa,Continua
2,sex,"Sexo da pessoa que pagou ('Male','Female')",Qualitativa,Nominal
3,smoker,"Se a pesoa é fumante ou não ('Yes','No')",Qualitativa,Nominal
4,day,"Indica os dias da semana ('Sun', 'Sat', 'Thur'...",Qualitativa,Ordinal
5,time,Indica se a compra foi feita em determinado pe...,Qualitativa,Ordinal
6,size,Indica o número de pessoas,Quantitava,Discreta

## Estatísticas de tendencia central e dispersão

In [35]:
#Selecionando apenas as colunas com valores quantitativos
lista = dict_gorjetas.query('tipo == "Quantitativa"')['variavel']
gorjetas_filtrada = gorjetas[lista]

In [36]:
#Média
gorjetas_filtrada.mean()

total_bill    19.785943
tip            2.998279
size           2.569672
dtype: float64

In [37]:
#Mediana
gorjetas_filtrada.median()

total_bill    17.795
tip            2.900
size           2.000
dtype: float64

In [38]:
#Moda
gorjetas_filtrada.mode()

   total_bill  tip  size
0       13.42  2.0     2

In [39]:
#Variância
gorjetas_filtrada.var()

total_bill    79.252939
tip            1.914455
size           0.904591
dtype: float64

In [40]:
#Desvio padrão
gorjetas_filtrada.std()

total_bill    8.902412
tip           1.383638
size          0.951100
dtype: float64

## Estatísticas de tendencia central e dispersão (Separadas pelas variáveis categóricas)

In [37]:
#Criando lista de nomes das variáveis quantitativas da base gorjetas
lista_gorjetas = dict_gorjetas.query('tipo == "Quantitativa"')['variavel']
lista_gorjetas

0    total_bill
1           tip
Name: variavel, dtype: object

### sex

In [38]:
estatisticas_agrupadas(gorjetas,'sex',lista_gorjetas)

===============================================Média================================================

        total_bill       tip
sex
Male     20.744076  3.089618
Female   18.056897  2.833448

==============================================Mediana===============================================

        total_bill   tip
sex
Male         18.35  3.00
Female       16.40  2.75

================================================Moda================================================

                                        total_bill    tip
sex
Male    [10.34, 13.81, 15.69, 17.92, 18.29, 21.01]  [2.0]
Female                        [10.33, 13.0, 13.42]  [2.0]

=============================================Variância==============================================

        total_bill       tip
sex
Male     85.497185  2.217424
Female   64.147429  1.344428

===========================================Desvio Padrão============================================

        total_bill       tip
sex
Male     85.497185  2.217424
Female   64.147429  1.344428

### smoker

In [39]:
estatisticas_agrupadas(gorjetas,'smoker',lista_gorjetas)

===============================================Média================================================

        total_bill       tip
smoker
Yes      20.756344  3.008710
No       19.188278  2.991854

==============================================Mediana===============================================

        total_bill   tip
smoker
Yes          17.92  3.00
No           17.59  2.74

================================================Moda================================================

                          total_bill    tip
smoker
Yes             [13.0, 13.42, 15.69]  [2.0]
No      [10.07, 10.33, 15.98, 20.69]  [2.0]

=============================================Variância==============================================

        total_bill       tip
smoker
Yes      96.671256  1.964111
No       68.154632  1.896653

===========================================Desvio Padrão============================================

        total_bill       tip
smoker
Yes      96.671256  1.964111
No       68.154632  1.896653

### day

In [40]:
estatisticas_agrupadas(gorjetas,'day',lista_gorjetas)

===============================================Média================================================

      total_bill       tip
day
Thur   17.682742  2.771452
Fri    17.151579  2.734737
Sat    20.441379  2.993103
Sun    21.410000  3.255132

==============================================Mediana===============================================

      total_bill    tip
day
Thur       16.20  2.305
Fri        15.38  3.000
Sat        18.24  2.750
Sun        19.63  3.150

================================================Moda================================================

                                             total_bill    tip
day
Thur                                             [13.0]  [2.0]
Fri                                             [13.42]  [3.0]
Sat                                      [17.92, 20.29]  [3.0]
Sun   [7.25, 8.77, 9.6, 9.68, 9.94, 10.27, 10.29, 10...  [2.0]

=============================================Variância==============================================

      total_bill       tip
day
Thur   62.191683  1.538154
Fri    68.934158  1.039537
Sat    89.878338  2.660208
Sun    78.006376  1.524929

===========================================Desvio Padrão============================================

      total_bill       tip
day
Thur   62.191683  1.538154
Fri    68.934158  1.039537
Sat    89.878338  2.660208
Sun    78.006376  1.524929

### time

In [41]:
estatisticas_agrupadas(gorjetas,'time',lista_gorjetas)

===============================================Média================================================

        total_bill       tip
time
Lunch    17.168676  2.728088
Dinner   20.797159  3.102670

==============================================Mediana===============================================

        total_bill   tip
time
Lunch       15.965  2.25
Dinner      18.390  3.00

================================================Moda================================================

                                               total_bill         tip
time
Lunch                                             [13.42]       [2.0]
Dinner  [7.25, 13.81, 15.69, 17.92, 18.29, 20.29, 20.6...  [2.0, 3.0]

=============================================Variância==============================================

        total_bill       tip
time
Lunch    59.503973  1.452857
Dinner   83.576697  2.062793

===========================================Desvio Padrão============================================

        total_bill       tip
time
Lunch    59.503973  1.452857
Dinner   83.576697  2.062793

# Analisando base de dados(Titanic)

## Dicionário de dados

In [43]:
# criando o dicionário para a base titanic
dict_titanic = pd.DataFrame([
    {
        "variavel":"survived",
        "descricao":"Variavel bianria que indica de sobrevivel ou não ao acidente ( 0 se faleceu,1 se morreu)",
        "tipo":"Qualitativa",
        "subtipo":"Nominal"
    },{
        "variavel":"pclass",
        "descricao":"Indica a classe do navio em que a pessoa estava ( 3,2,1 )",
        "tipo":"Qualitativa",
        "subtipo":"Nominal"
    },{
        "variavel":"sex",
        "descricao":"Indica o sexo do passageiro",
        "tipo":"Qualitativa",
        "subtipo":"Nominal"
    },{
        "variavel":"age",
        "descricao":"Idade do passageiro",
        "tipo":"Quantitativa",
        "subtipo":"Discreta"
    },{
        "variavel":"sibsp",
        "descricao":"Quantidade de irmão,irmã,esposa,esposo como passageiros",
        "tipo":"Quantitativa",
        "subtipo":"Discreta"
    },{
        "variavel":"parch",
        "descricao":"Quantidade de filhos ou pais como passageiros",
        "tipo":"Quantitativa",
        "subtipo":"Discreta"
    },{
        "variavel":"fare",
        "descricao":"Valor do bilhete",
        "tipo":"Quantitativa",
        "subtipo":"Continua"
    },{
        "variavel":"embarked",
        "descricao":"Nome do porto em que as pessoas embarcaram (C = Cherbourg, Q = Queenstown, S = Southampton)",
        "tipo":"Qualitativa",
        "subtipo":"Nominal"
    },{
        "variavel":"class",
        "descricao":"Indica a classe do navio em que a pessoa estava ('Third', 'First', 'Second')",
        "tipo":"Qualitativa",
        "subtipo":"Nominal"
    },{
        "variavel":"who",
        "descricao":"Indica se é homen,mulher ou criança ('man', 'woman', 'child')",
        "tipo":"Qualitativa",
        "subtipo":"Nominal"
    },{
        "variavel":"adult_male",
        "descricao":"Variavel binaria para indicar  se é um homem adulto ",
        "tipo":"Qualitativa",
        "subtipo":"Nominal"
    }, {
        "variavel":"deck",
        "descricao":"? ",
        "tipo":"Qualitativa",
        "subtipo":"Nominal"
    },{
        "variavel":"embark_town",
        "descricao":"Cidade quem que o passageiro embarcou",
        "tipo":"Qualitativa",
        "subtipo":"Nominal"
    },{
        "variavel":"alive",
        "descricao":"Indica se a pessoa sobrevivel (no = não,yes = sim)",
        "tipo":"Qualitativa",
        "subtipo":"Nominal"
    },{
        "variavel":"alone",
        "descricao":"Passageiro estava sozinho ou não (False = não,True = sim)",
        "tipo":"Qualitativa",
        "subtipo":"Nominal"
    }
])

In [44]:
dict_titanic.head()

,variavel,descricao,tipo,subtipo
0,survived,Variavel bianria que indica de sobrevivel ou n...,Qualitativa,Nominal
1,pclass,Indica a classe do navio em que a pessoa estav...,Qualitativa,Nominal
2,sex,Indica o sexo do passageiro,Qualitativa,Nominal
3,age,Idade do passageiro,Quantitativa,Discreta
4,sibsp,"Quantidade de irmão,irmã,esposa,esposo como pa...",Quantitativa,Discreta

## Estatísticas de tendencia central e dispersão

In [45]:
#Selecionando apenas as colunas com valores quantitativos
lista = dict_titanic.query('tipo == "Quantitativa"')['variavel']
titanic_filtrado = titanic[lista]

In [46]:
#Média
titanic_filtrado.mean()

age      29.699118
sibsp     0.523008
parch     0.381594
fare     32.204208
dtype: float64

In [47]:
#Mediana
titanic_filtrado.median()

age      28.0000
sibsp     0.0000
parch     0.0000
fare     14.4542
dtype: float64

In [48]:
#Moda
titanic_filtrado.mode()

    age  sibsp  parch  fare
0  24.0      0      0  8.05

In [49]:
#Variância
titanic_filtrado.var()

age       211.019125
sibsp       1.216043
parch       0.649728
fare     2469.436846
dtype: float64

In [50]:
#Desvio padrão
titanic_filtrado.std()

age      14.526497
sibsp     1.102743
parch     0.806057
fare     49.693429
dtype: float64

## Estatísticas de tendencia central e dispersão (Separadas pelas variáveis categóricas)

In [59]:
#Criando lista de nomes das variáveis quantitativas da base titanic
lista_titanic = dict_titanic.query('tipo == "Quantitativa"')['variavel']
lista_titanic

3      age
4    sibsp
5    parch
6     fare
Name: variavel, dtype: object

### survived

In [53]:
estatisticas_agrupadas(titanic,'survived',lista_titanic)

===============================================Média================================================

                age     sibsp     parch       fare
survived
0         30.626179  0.553734  0.329690  22.117887
1         28.343690  0.473684  0.464912  48.395408

==============================================Mediana===============================================

           age  sibsp  parch  fare
survived
0         28.0    0.0    0.0  10.5
1         28.0    0.0    0.0  26.0

================================================Moda================================================

             age sibsp parch    fare
survived
0         [21.0]   [0]   [0]  [8.05]
1         [24.0]   [0]   [0]  [13.0]

=============================================Variância==============================================

                 age     sibsp     parch         fare
survived
0         200.848698  1.659972  0.677602   985.219509
1         223.530965  0.502238  0.595539  4435.160158

===========================================Desvio Padrão============================================

                 age     sibsp     parch         fare
survived
0         200.848698  1.659972  0.677602   985.219509
1         223.530965  0.502238  0.595539  4435.160158

### pclass

In [54]:
estatisticas_agrupadas(titanic,'pclass',lista_titanic)

===============================================Média================================================

              age     sibsp     parch       fare
pclass
1       38.233441  0.416667  0.356481  84.154687
2       29.877630  0.402174  0.380435  20.662183
3       25.140620  0.615071  0.393075  13.675550

==============================================Mediana===============================================

         age  sibsp  parch     fare
pclass
1       37.0    0.0    0.0  60.2875
2       29.0    0.0    0.0  14.2500
3       24.0    0.0    0.0   8.0500

================================================Moda================================================

                 age sibsp parch     fare
pclass
1       [35.0, 36.0]   [0]   [0]  [26.55]
2       [24.0, 34.0]   [0]   [0]   [13.0]
3             [22.0]   [0]   [0]   [8.05]

=============================================Variância==============================================

               age     sibsp     parch         fare
pclass
1       219.124543  0.374419  0.481632  6143.482816
2       196.030152  0.361962  0.477429   180.026589
3       156.134976  1.890303  0.790074   138.724622

===========================================Desvio Padrão============================================

               age     sibsp     parch         fare
pclass
1       219.124543  0.374419  0.481632  6143.482816
2       196.030152  0.361962  0.477429   180.026589
3       156.134976  1.890303  0.790074   138.724622

### sex

In [55]:
estatisticas_agrupadas(titanic,'sex',lista_titanic)

===============================================Média================================================

              age     sibsp     parch       fare
sex
female  27.915709  0.694268  0.649682  44.479818
male    30.726645  0.429809  0.235702  25.523893

==============================================Mediana===============================================

         age  sibsp  parch  fare
sex
female  27.0    0.0    0.0  23.0
male    29.0    0.0    0.0  10.5

================================================Moda================================================

                       age sibsp parch    fare
sex
female              [24.0]   [0]   [0]  [7.75]
male    [19.0, 25.0, 28.0]   [0]   [0]  [8.05]

=============================================Variância==============================================

               age     sibsp     parch         fare
sex
female  199.096233  1.337539  1.046214  3363.732930
male    215.449579  1.127443  0.374904  1860.909702

===========================================Desvio Padrão============================================

               age     sibsp     parch         fare
sex
female  199.096233  1.337539  1.046214  3363.732930
male    215.449579  1.127443  0.374904  1860.909702

### embarked

In [60]:
estatisticas_agrupadas(titanic,'embarked',lista_titanic)

===============================================Média================================================

                age     sibsp     parch       fare
embarked
C         30.814769  0.386905  0.363095  59.954144
Q         28.089286  0.428571  0.168831  13.276030
S         29.445397  0.571429  0.413043  27.079812

==============================================Mediana===============================================

           age  sibsp  parch   fare
embarked
C         29.0    0.0    0.0  29.70
Q         27.0    0.0    0.0   7.75
S         28.0    0.0    0.0  13.00

================================================Moda================================================

                               age sibsp parch      fare
embarked
C                     [24.0, 30.0]   [0]   [0]  [7.2292]
Q         [16.0, 19.0, 21.0, 32.0]   [0]   [0]    [7.75]
S                     [24.0, 28.0]   [0]   [0]    [8.05]

=============================================Variância==============================================

                 age     sibsp     parch         fare
embarked
C         238.234892  0.310486  0.436235  7041.390607
Q         286.130622  0.958647  0.431647   201.300677
S         200.029876  1.480116  0.728041  1287.948067

===========================================Desvio Padrão============================================

                 age     sibsp     parch         fare
embarked
C         238.234892  0.310486  0.436235  7041.390607
Q         286.130622  0.958647  0.431647   201.300677
S         200.029876  1.480116  0.728041  1287.948067

### class

In [61]:
estatisticas_agrupadas(titanic,'class',lista_titanic)

===============================================Média================================================

              age     sibsp     parch       fare
class
First   38.233441  0.416667  0.356481  84.154687
Second  29.877630  0.402174  0.380435  20.662183
Third   25.140620  0.615071  0.393075  13.675550

==============================================Mediana===============================================

         age  sibsp  parch     fare
class
First   37.0    0.0    0.0  60.2875
Second  29.0    0.0    0.0  14.2500
Third   24.0    0.0    0.0   8.0500

================================================Moda================================================

                 age sibsp parch     fare
class
First   [35.0, 36.0]   [0]   [0]  [26.55]
Second  [24.0, 34.0]   [0]   [0]   [13.0]
Third         [22.0]   [0]   [0]   [8.05]

=============================================Variância==============================================

               age     sibsp     parch         fare
class
First   219.124543  0.374419  0.481632  6143.482816
Second  196.030152  0.361962  0.477429   180.026589
Third   156.134976  1.890303  0.790074   138.724622

===========================================Desvio Padrão============================================

               age     sibsp     parch         fare
class
First   219.124543  0.374419  0.481632  6143.482816
Second  196.030152  0.361962  0.477429   180.026589
Third   156.134976  1.890303  0.790074   138.724622

### who

In [62]:
estatisticas_agrupadas(titanic,'who',lista_titanic)

===============================================Média================================================

             age     sibsp     parch       fare
who
child   6.369518  1.734940  1.265060  32.785795
man    33.173123  0.296089  0.152700  24.864182
woman  32.000000  0.601476  0.564576  46.570711

==============================================Mediana===============================================

        age  sibsp  parch   fare
who
child   5.0    1.0    1.0  26.25
man    30.0    0.0    0.0   9.50
woman  30.0    0.0    0.0  23.25

================================================Moda================================================

                      age sibsp parch      fare
who
child          [2.0, 4.0]   [1]   [1]  [31.275]
man    [19.0, 25.0, 28.0]   [0]   [0]    [8.05]
woman              [24.0]   [0]   [0]    [7.75]

=============================================Variância==============================================

              age     sibsp     parch         fare
who
child   22.364041  2.684984  0.465472  1120.002500
man    166.588281  0.723735  0.278878  1937.878308
woman  132.145161  1.196146  1.068963  3638.381145

===========================================Desvio Padrão============================================

              age     sibsp     parch         fare
who
child   22.364041  2.684984  0.465472  1120.002500
man    166.588281  0.723735  0.278878  1937.878308
woman  132.145161  1.196146  1.068963  3638.381145

### adult_male

In [63]:
estatisticas_agrupadas(titanic,'adult_male',lista_titanic)

===============================================Média================================================

                  age     sibsp     parch       fare
adult_male
False       24.932458  0.867232  0.728814  43.338655
True        33.173123  0.296089  0.152700  24.864182

==============================================Mediana===============================================

             age  sibsp  parch   fare
adult_male
False       24.0    0.0    0.0  24.15
True        30.0    0.0    0.0   9.50

================================================Moda================================================

                           age sibsp parch    fare
adult_male
False                   [24.0]   [0]   [0]  [26.0]
True        [19.0, 25.0, 28.0]   [0]   [0]  [8.05]

=============================================Variância==============================================

                   age     sibsp     parch         fare
adult_male
False       233.329505  1.769858  1.014068  3077.272372
True        166.588281  0.723735  0.278878  1937.878308

===========================================Desvio Padrão============================================

                   age     sibsp     parch         fare
adult_male
False       233.329505  1.769858  1.014068  3077.272372
True        166.588281  0.723735  0.278878  1937.878308

### deck

In [64]:
estatisticas_agrupadas(titanic,'deck',lista_titanic)

===============================================Média================================================

            age     sibsp     parch        fare
deck
A     44.833333  0.133333  0.133333   39.623887
B     34.955556  0.361702  0.574468  113.505764
C     36.086667  0.644068  0.474576  100.151341
D     39.032258  0.424242  0.303030   57.244576
E     38.116667  0.312500  0.312500   46.026694
F     19.954545  0.538462  0.538462   18.696792
G     14.750000  0.500000  1.250000   13.581250

==============================================Mediana===============================================

       age  sibsp  parch      fare
deck
A     44.0    0.0    0.0  35.50000
B     33.0    0.0    0.0  80.00000
C     36.0    1.0    0.0  83.47500
D     37.0    0.0    0.0  53.10000
E     39.0    0.0    0.0  45.18125
F     24.0    0.0    0.0  13.00000
G     14.0    0.5    1.0  13.58125

================================================Moda================================================

,age,sibsp,parch,fare
deck,,,,
A,[56.0],[0],[0],[35.5]
B,"[24.0, 36.0]",[0],[0],[120.0]
C,"[35.0, 38.0]",[0],[0],"[26.55, 90.0, 263.0]"
D,[23.0],[0],[0],"[52.5542, 76.7292, 77.9583, 113.275]"
E,"[27.0, 39.0]",[0],[0],"[26.2875, 26.55, 79.65]"
F,"[1.0, 2.0, 3.0, 4.0, 19.0, 24.0, 25.0, 29.0, 3...",[0],[0],"[7.65, 26.0]"
G,"[2.0, 4.0, 24.0, 29.0]","[0, 1]",[1],"[10.4625, 16.7]"

=============================================Variância==============================================

             age     sibsp     parch          fare
deck
A     406.878788  0.123810  0.266667    323.112595
B     239.997980  0.322849  0.597595  11946.817958
C     206.769467  0.612507  0.770894   4931.633261
D     209.098925  0.251894  0.342803    875.735688
E     158.511782  0.221774  0.286290   1063.302214
F     230.522727  0.602564  0.435897    137.551085
G     188.916667  0.333333  0.250000     12.968802

===========================================Desvio Padrão============================================

             age     sibsp     parch          fare
deck
A     406.878788  0.123810  0.266667    323.112595
B     239.997980  0.322849  0.597595  11946.817958
C     206.769467  0.612507  0.770894   4931.633261
D     209.098925  0.251894  0.342803    875.735688
E     158.511782  0.221774  0.286290   1063.302214
F     230.522727  0.602564  0.435897    137.551085
G     188.916667  0.333333  0.250000     12.968802

### embark_town

In [65]:
estatisticas_agrupadas(titanic,'embark_town',lista_titanic)

===============================================Média================================================

                   age     sibsp     parch       fare
embark_town
Cherbourg    30.814769  0.386905  0.363095  59.954144
Queenstown   28.089286  0.428571  0.168831  13.276030
Southampton  29.445397  0.571429  0.413043  27.079812

==============================================Mediana===============================================

              age  sibsp  parch   fare
embark_town
Cherbourg    29.0    0.0    0.0  29.70
Queenstown   27.0    0.0    0.0   7.75
Southampton  28.0    0.0    0.0  13.00

================================================Moda================================================

                                  age sibsp parch      fare
embark_town
Cherbourg                [24.0, 30.0]   [0]   [0]  [7.2292]
Queenstown   [16.0, 19.0, 21.0, 32.0]   [0]   [0]    [7.75]
Southampton              [24.0, 28.0]   [0]   [0]    [8.05]

=============================================Variância==============================================

                    age     sibsp     parch         fare
embark_town
Cherbourg    238.234892  0.310486  0.436235  7041.390607
Queenstown   286.130622  0.958647  0.431647   201.300677
Southampton  200.029876  1.480116  0.728041  1287.948067

===========================================Desvio Padrão============================================

                    age     sibsp     parch         fare
embark_town
Cherbourg    238.234892  0.310486  0.436235  7041.390607
Queenstown   286.130622  0.958647  0.431647   201.300677
Southampton  200.029876  1.480116  0.728041  1287.948067

### alive

In [66]:
estatisticas_agrupadas(titanic,'alive',lista_titanic)

===============================================Média================================================

             age     sibsp     parch       fare
alive
no     30.626179  0.553734  0.329690  22.117887
yes    28.343690  0.473684  0.464912  48.395408

==============================================Mediana===============================================

        age  sibsp  parch  fare
alive
no     28.0    0.0    0.0  10.5
yes    28.0    0.0    0.0  26.0

================================================Moda================================================

          age sibsp parch    fare
alive
no     [21.0]   [0]   [0]  [8.05]
yes    [24.0]   [0]   [0]  [13.0]

=============================================Variância==============================================

              age     sibsp     parch         fare
alive
no     200.848698  1.659972  0.677602   985.219509
yes    223.530965  0.502238  0.595539  4435.160158

===========================================Desvio Padrão============================================

              age     sibsp     parch         fare
alive
no     200.848698  1.659972  0.677602   985.219509
yes    223.530965  0.502238  0.595539  4435.160158

### alone

In [67]:
estatisticas_agrupadas(titanic,'alone',lista_titanic)

===============================================Média================================================

             age     sibsp     parch       fare
alone
False  26.413452  1.316384  0.960452  48.832275
True   32.220297  0.000000  0.000000  21.242689

==============================================Mediana===============================================

        age  sibsp  parch     fare
alone
False  26.0    1.0    1.0  27.7500
True   29.5    0.0    0.0   8.1375

================================================Moda================================================

                age sibsp parch    fare
alone
False  [18.0, 24.0]   [1]   [0]  [26.0]
True   [22.0, 30.0]   [0]   [0]  [8.05]

=============================================Variância==============================================

              age     sibsp     parch         fare
alone
False  250.744797  2.018598  1.080584  3058.932321
True   166.406684  0.000000  0.000000  1782.824830

===========================================Desvio Padrão============================================

              age     sibsp     parch         fare
alone
False  250.744797  2.018598  1.080584  3058.932321
True   166.406684  0.000000  0.000000  1782.824830

# Analisando as bases de dados (ascomb)

## Dicionário de dados

In [51]:
dict_ascomb = pd.DataFrame([
    {
        "variavel":"dataset",
        "descricao":"Indica que dataset pertence aqueles dados (I', 'II', 'III', 'IV')",
        "tipo":"Qualitativa",
        "subtipo":"Nominal"
    },{
        "variavel":"x",
        "descricao":"?",
        "tipo":"Quantitativa",
        "subtipo":"Continua"
    },{
        "variavel":"y",
        "descricao":"?",
        "tipo":"Quantitativa",
        "subtipo":"Continua"
    }
])

In [31]:
quarteto_ascombe.head()

  dataset     x     y
0       I  10.0  8.04
1       I   8.0  6.95
2       I  13.0  7.58
3       I   9.0  8.81
4       I  11.0  8.33

## Estatísticas de tendencia central e dispersão

In [52]:
#Selecionando apenas as colunas com valores quantitativos
lista = dict_ascomb.query('tipo == "Quantitativa"')['variavel']
quarteto_ascombe_filtrado = quarteto_ascombe[lista]

In [53]:
#Média
quarteto_ascombe_filtrado.mean()

x    9.000000
y    7.500682
dtype: float64

In [54]:
#Mediana
quarteto_ascombe_filtrado.median()

x    8.00
y    7.52
dtype: float64

In [55]:
#Moda
quarteto_ascombe_filtrado.mode()

     x     y
0  8.0  8.84

In [56]:
#Variância
quarteto_ascombe_filtrado.var()

x    10.232558
y     3.837388
dtype: float64

In [57]:
#Desvio padrão
quarteto_ascombe_filtrado.std()

x    3.198837
y    1.958925
dtype: float64

## Estatísticas de tendencia central e dispersão (Separadas pelas variáveis categóricas)

In [58]:
#Criando lista de nomes das variáveis quantitativas da base ascomb
lista_ascomb = dict_ascomb.query('tipo == "Quantitativa"')['variavel']
lista_ascomb

1    x
2    y
Name: variavel, dtype: object

### Dataset

In [61]:
estatisticas_agrupadas(quarteto_ascombe,'dataset',lista_ascomb)

===============================================Média================================================

           x         y
dataset
I        9.0  7.500909
II       9.0  7.500909
III      9.0  7.500000
IV       9.0  7.500909

==============================================Mediana===============================================

           x     y
dataset
I        9.0  7.58
II       9.0  8.14
III      9.0  7.11
IV       8.0  7.04

================================================Moda================================================

,x,y
dataset,,
I,"[4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0, 11.0, 12....","[4.26, 4.82, 5.68, 6.95, 7.24, 7.58, 8.04, 8.3..."
II,"[4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0, 11.0, 12....","[3.1, 4.74, 6.13, 7.26, 8.1, 8.14, 8.74, 8.77,..."
III,"[4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0, 11.0, 12....","[5.39, 5.73, 6.08, 6.42, 6.77, 7.11, 7.46, 7.8..."
IV,[8.0],"[5.25, 5.56, 5.76, 6.58, 6.89, 7.04, 7.71, 7.9..."

=============================================Variância==============================================

            x         y
dataset
I        11.0  4.127269
II       11.0  4.127629
III      11.0  4.122620
IV       11.0  4.123249

===========================================Desvio Padrão============================================

            x         y
dataset
I        11.0  4.127269
II       11.0  4.127629
III      11.0  4.122620
IV       11.0  4.123249